jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F2xx_DFP.2.4.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32F2xx_DFP</name>
  <description>STMicroelectronics STM32F2 Series Device Support, Drivers and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.4.0" date="2015-09-16">
      Introducing MDK-ARM configuration via STM32CubeMX:
      - see documentation for component Device:STM32CubeFramework:STM32CubeMX
      CMSIS driver:
      - added CAN driver and configuration options in RTE_Device.h
      - updated EMAC driver: corrected lockup after long runtime
      - updated MCI driver: corrected clock divider bypass handling
      - updated USART driver: corrected driver incorrectly stopped receiving data when calling the USART_Receive function while the receiver is busy
      - update I2C driver: corrected 3 byte reception and POS bit handling in master mode as well as corrected acknowledge handling in slave mode
      MDK example projects:
      - added examples created using MDK and STM32CubeMX: Blinky and emWin GUI_VNC for Keil MCBSTM32F200
      - added CAN Data and RTR projects for Keil MCBSTM32F200
      - updated FTP_Server example: Heap memory increased
    </release>
    <release version="2.3.0" date="2015-06-12">
      Updated CMSIS drivers:
      - I2C, MCI, EMAC, USB Device, USB Host: Updated initialization, uninitialization and power procedures
      - MCI: Corrected data timeout handling
      - SPI:
      -- Corrected status bit-field handling, to prevent race conditions
      -- Corrected ARM_SPI_EVENT_DATA_LOST event generation in master mode at high bus speeds
      -- Corrected bus speed configuration
      - USART:
      -- Corrected status bit-field handling, to prevent race conditions
      -- Added RX TimeOut handling
      - USB Device: Corrected transferred size during transfer
      - USB Host: 
      -- Added pipe bus error signaling of active pipes on port disconnect
      -- Corrected handling on error transfers
      Updated MDK examples:
      - Boards\Keil\MCBSTM32F200\Blinky
      - USB Device Mass Storage Example
    </release>
    <release version="2.2.0" date="2015-03-20">
      Required PACKs: ARM.CMSIS.4.3.0.pack, Keil.MDK-Middleware.6.3.0.pack, Keil.ARM_Compiler.1.0.0.pack
      Updated drivers:
      - USB Host: Corrected signalling of STALL handshake
      - USB Device:
      -- Corrected IN ZLP sending
      -- VBUS sensing disabled if ARM_USBD_VBUS_DETECT is not enabled
      - USART: corrected when configured via STM32CubeMX
      - I2C:
      -- includes corrected when configured with STM32CubeMX
      -- corrected transfer issues after ARM_I2C_EVENT_ADDRESS_NACK
      - MCI:
      -- includes corrected when configured with STM32CubeMX
      -- correction required due to device errata
      -- added support for SD high speed bus mode
      - SPI: corrected spi->info->mode handling
      Updated examples:
      - Compiler I/O software component is now used for I/O retargeting
      - Updated Network examples for MCBSTM32F200 V1.2 board with KSZ8081RNA Ethernet PHY
      Updated dependencies: 
      - Ethernet does not require CMSIS:RTOS
    </release>  
    <release version="2.1.0" date="2014-12-11">
      Updated drivers:
      - I2C: corrected slave mode and 10-bit addressing mode, I2C2 SDA pin configuration
      - USB Host:
      -- corrected interrupt pipe behaviour, and PING on high-speed driver, init/deinit and power control
      -- added VBUS Power pin active high/low functionality, overcurrent state functionality (without event) added
      - USB Device: prevent simultaneous IN writes to FIFO
      - USART and SPI: corrected DMA transfer abort
      - MCI: corrected setting of bus width
      - EMAC: implemented function 'GetMacAddress'
      - EMAC, I2C, MCI, USART, SPI and USBD: corrected some basic MISRA 2004 compliances like signedness, boolean operation on logical operators
      Updated RTE_Device.h: added Receive and transmit DMA configuration for SDIO peripheral
      Renamed SDIO component in 'Device::STM32Cube HAL' to 'SD' to match HAL component name
      Updated examples:
      - File_Demo and USB Host MassStorage examples updated due to the new fdelete() API in File System Version 6.2
      - MCBSTM32F200 USB Host Keyboard example (removed USB High-speed usage)
      - updated RTE_Device.h to version 2.01
    </release>
    <release version="2.0.0" date="2014-10-16">
      PACK based on STMicroelectronics STM32CubeF2 Firmware Package V1.1.0
      - STD Peripheral Library components removed
      New Device variants introduced matching ST Cube device database
      - e.g. STM32F207IG -> STM32F207IGHx or STM32F207IGTx
      CMSIS Drivers Version 2 (changed Cclass "Drivers" to "CMSIS Driver")
      - Ethernet MAC, I2C, MCI, SPI, USART, USB Device, USB Host
      MDK-ARM Example projects require MDK-Middleware 6.1.1 and CMSIS 4.2.0
      - Board Support uses Board Interface API from MDK-Middleware (header file names changed)
      - Board: Keil MCBSTM32F200
    </release>
    <release version="1.0.8">
      Device: Startup files for GCC added, conditions extended to reflect toolchain dependencies
    </release>
    <release version="1.0.7" date="2014-04-29">
      Updated I2C driver  (BUG Fix: 2 byte reception)
      Device:StdPeriph Drivers:Framework Version:1.1.1 - added file misc.c
    </release>
    <release version="1.0.6">
      Added STM Peripheral Driver Library V1.1.0
    </release>
    <release version="1.0.5">
      Updated I2c driver (corrected register access)
      USB Device drivers update: multiple packet read, EP0 unconfiguration
      Updated SPI driver (IRQ handling corrected)
    </release>
    <release version="1.0.4">
      Updated drivers (namespace prefix ARM_ added)
    </release>
    <release version="1.0.3">
      Added STM32F200 Board Support Bundle
    </release>
    <release version="1.0.2">
      Added emWin Example and GUIDemo for MCBSTM32F200
      Added emWin LCD driver for MCBSTM32F200
      Updated USBH Drivers (improved robustness)
    </release>
    <release version="1.0.1">
      Generic Drivers moved to "Drivers" Class
      Added UART and I2C Driver
      Updated USBD and USBH Drivers
      Added MCBSTM32F200 Demo example
      Added MCBSTM32F200 USB Host Keyboard example
      Added MCBSTM32F200 BSP Drivers: Joystick, Touchscreen, Accelerometer, Gyroscope, Camera
      Updated MCBSTM32F200 BSP Driver: Keyboard
      Updated all MCBSTM32F200 examples
      Minor corrections:
      - SPI Driver
      - DMA Driver
      - MCI Driver
    </release>
    <release version="1.0.0">
      First Release version of STM32F2 Device Family Pack.
    </release>
    <release version="0.9.0">
      Beta version of STM32F2 Device Family Pack.
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32F2</keyword>
    <keyword>STM32F2xx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="STM32F2 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <book    name="Documentation/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
The STM32F2 family incorporates high-speed embedded memories and an extensive range of enhanced I/Os and peripherals connected to two APB buses, three AHB buses and a 32-bit multi-AHB bus matrix.
Typical applications include Motor drive and application control Medical equipment, Industrial applications: PLC, inverters, circuit breakers, Printers and scanners, Alarm systems, video intercom, and HVAC, Home audio appliances.

  - Adaptive real-time memory accelerator (ART)
  - LCD parallel interface, 8080/6800 modes
  - Multi-layer bus matrix
  - 5 V-tolerant I/Os
  - Timer with quadrature (incremental) encoder input
  - Parallel camera interface
  - Analog true random number generator
  - 96-bit unique ID
      </description>

      <feature type="Timer"         n="12"      m="16"/>
      <feature type="Timer"         n="2"       m="32"/>
      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="DAC"           n="2"       m="12"/>
      <feature type="SPI"           n="3"       m="30000000"/>
      <feature type="I2S"           n="2"/>
      <feature type="USART"         n="4"       m="7500000"/>
      <feature type="UART"          n="2"       m="7500000"/>
      <feature type="USBOTG"        n="1"                           name="USB OTG Full Speed"/>
      <feature type="USBOTG"        n="1"                           name="USB OTG High Speed"/>
      <feature type="CAN"           n="2"/>
      <feature type="SDIO"          n="1"                           name="Secure Digital IO"/>
      <feature type="RNG"           n="1"/>
      <feature type="VCC"           n="1.80"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="Temp"          n="-40"     m="105"/>

      <!-- ************************  Subfamily 'STM32F205'  **************************** -->
      <subFamily DsubFamily="STM32F205">
        <processor Dclock="120000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"  define="STM32F205xx"/>
        <debug      svd="CMSIS\SVD\STM32F20x.svd"/>
        <book       name="Documentation/CD00225773.pdf"      title="STM32F205/207/215/217 Reference Manual"/>
        <book       name="Documentation/CD00237391.pdf"      title="STM32F205/207 Data Sheet"/>
        <book       name="Documentation/DM00027213.pdf"      title="STM32F205/207/215/217 Errata Sheet"/>
        <feature type="I2C"           n="3"/>

        <!-- *************************  Device 'STM32F205RB'  ***************************** -->
        <device Dname="STM32F205RB">
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F205RBTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205RC'  ***************************** -->
        <device Dname="STM32F205RC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F205RCTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205RE'  ***************************** -->
        <device Dname="STM32F205RE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F205RETx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F205REYx"> <feature type="CSP" n="66"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205RF'  ***************************** -->
        <device Dname="STM32F205RF">
          <memory     id="IROM1"                             start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0xC0000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F205RFTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205RG'  ***************************** -->
        <device Dname="STM32F205RG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F205RGTx"> <feature type="QFP" n="64"/> </variant>
          <variant Dvariant="STM32F205RGYx"> <feature type="CSP" n="66"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205VB'  ***************************** -->
        <device Dname="STM32F205VB">
          <memory     id="IROM1"                             start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205VBTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205VC'  ***************************** -->
        <device Dname="STM32F205VC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205VE'  ***************************** -->
        <device Dname="STM32F205VE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205VF'  ***************************** -->
        <device Dname="STM32F205VF">
          <memory     id="IROM1"                             start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0xC0000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205VFTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205VG'  ***************************** -->
        <device Dname="STM32F205VG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205ZC'  ***************************** -->
        <device Dname="STM32F205ZC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205ZCTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205ZE'  ***************************** -->
        <device Dname="STM32F205ZE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F205ZF'  ***************************** -->
        <device Dname="STM32F205ZF">
          <memory     id="IROM1"                             start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0xC0000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205ZFTx"> <feature type="QFP" n="144"/> </variant>
        </device>

