jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F2xx_DFP.2.4.0.pdsc
        <!-- *************************  Device 'STM32F205ZG'  ***************************** -->
        <device Dname="STM32F205ZG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F205ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F207'  **************************** -->
      <subFamily DsubFamily="STM32F207">
        <processor Dclock="120000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"  define="STM32F207xx"/>
        <debug      svd="CMSIS\SVD\STM32F20x.svd"/>
        <book       name="Documentation/CD00225773.pdf"      title="STM32F205/207/215/217 Reference Manual"/>
        <book       name="Documentation/CD00237391.pdf"      title="STM32F205/207 Data Sheet"/>
        <book       name="Documentation/DM00027213.pdf"      title="STM32F205/207/215/217 Errata Sheet"/>
        <feature type="I2C"           n="2"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="Camera"        n="14"/>

        <!-- *************************  Device 'STM32F207VC'  ***************************** -->
        <device Dname="STM32F207VC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F207VCTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207VE'  ***************************** -->
        <device Dname="STM32F207VE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F207VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207VF'  ***************************** -->
        <device Dname="STM32F207VF">
          <memory     id="IROM1"                             start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0xC0000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F207VFTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207VG'  ***************************** -->
        <device Dname="STM32F207VG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F207VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207ZC'  ***************************** -->
        <device Dname="STM32F207ZC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F207ZCTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207ZE'  ***************************** -->
        <device Dname="STM32F207ZE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F207ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207ZF'  ***************************** -->
        <device Dname="STM32F207ZF">
          <memory     id="IROM1"                             start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0xC0000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F207ZFTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207ZG'  ***************************** -->
        <device Dname="STM32F207ZG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <variant Dvariant="STM32F207ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207IC'  ***************************** -->
        <device Dname="STM32F207IC">
          <memory     id="IROM1"                             start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x40000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F207ICTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F207ICHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207IE'  ***************************** -->
        <device Dname="STM32F207IE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F207IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F207IEHx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F207IF'  ***************************** -->
        <device Dname="STM32F207IF">
          <memory     id="IROM1"                             start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0xC0000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F207IFTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F207IFHx"> <feature type="BGA" n="176"/> </variant>
        </device>

