jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F2xx_DFP.2.4.0.pdsc
        <!-- *************************  Device 'STM32F207IG'  ***************************** -->
        <device Dname="STM32F207IG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="140"/>
          <variant Dvariant="STM32F207IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F207IGHx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F215'  **************************** -->
      <subFamily DsubFamily="STM32F215">
        <processor Dclock="120000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"  define="STM32F215xx"/>
        <debug      svd="CMSIS\SVD\STM32F21x.svd"/>
        <book       name="Documentation/CD00225773.pdf"      title="STM32F205/207/215/217 Reference Manual"/>
        <book       name="Documentation/CD00263874.pdf"      title="STM32F215/217 Data Sheet"/>
        <book       name="Documentation/DM00027213.pdf"      title="STM32F205/207/215/217 Errata Sheet"/>
        <feature type="I2C"           n="3"/>
        <feature type="Crypto"        n="1"                           name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1)"/>

        <!-- *************************  Device 'STM32F215RE'  ***************************** -->
        <device Dname="STM32F215RE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F215RETx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215RG'  ***************************** -->
        <device Dname="STM32F215RG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F215RGTx"> <feature type="QFP" n="64"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215VE'  ***************************** -->
        <device Dname="STM32F215VE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F215VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215VG'  ***************************** -->
        <device Dname="STM32F215VG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F215VGTx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215ZE'  ***************************** -->
        <device Dname="STM32F215ZE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F215ZETx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F215ZG'  ***************************** -->
        <device Dname="STM32F215ZG">
          <memory     id="IROM1"                             start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="ExtBus"        n="16"/>
          <variant Dvariant="STM32F215ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F217'  **************************** -->
      <subFamily DsubFamily="STM32F217">
        <processor Dclock="120000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"  define="STM32F217xx"/>
        <debug      svd="CMSIS\SVD\STM32F21x.svd"/>
        <book       name="Documentation/CD00225773.pdf"      title="STM32F205/207/215/217 Reference Manual"/>
        <book       name="Documentation/CD00263874.pdf"      title="STM32F215/217 Data Sheet"/>
        <book       name="Documentation/DM00027213.pdf"      title="STM32F205/207/215/217 Errata Sheet"/>
        <feature type="I2C"           n="3"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="Crypto"        n="1"                           name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1)"/>
        <feature type="ExtBus"        n="16"/>
        <feature type="Camera"        n="14"/>

        <!-- *************************  Device 'STM32F217VE'  ***************************** -->
        <device Dname="STM32F217VE">
          <memory     id="IROM1"                             start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                             start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_1024.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OPT.FLM"   start="0x1FFFC000"  size="0x10"                     default="0"/>
          <algorithm  name="CMSIS/Flash/STM32F2xx_OTP.FLM"   start="0x1FFF7800"  size="0x0210"                   default="0"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="82"/>
          <variant Dvariant="STM32F217VETx"> <feature type="QFP" n="100"/> </variant>
        </device>

