jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F2xx_DFP.2.4.0.pdsc
    <example name="HTTP Server" doc="Abstract.txt" folder="MDK\Boards\Keil\MCBSTM32F200\Middleware\Network\HTTP_Server" version="1.0.1">
      <description>Compact Web Server with CGI interface</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client" doc="Abstract.txt" folder="MDK\Boards\Keil\MCBSTM32F200\Middleware\Network\SMTP_Client" version="1.0.1">
      <description>Example showing how to compose and send emails</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="MDK\Boards\Keil\MCBSTM32F200\Middleware\Network\SNMP_Agent" version="1.0.1">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="MDK\Boards\Keil\MCBSTM32F200\Middleware\Network\Telnet_Server" version="1.0.1">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="MCBSTM32F200" vendor="Keil"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>
  </examples>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <taxonomy>
    <description Cclass="Device" Cgroup="STM32Cube HAL">STM32F2xx Hardware Abstraction Layer (HAL) Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>
  
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.1" condition="STM32F2 CMSIS HAL">  <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F2 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32F2XX    /* Device Startup for STM32F2 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32F2xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" condition="STM32F2_ARMCC"  name="MDK/Device/Source/ARM/STM32F2xx_OPT.s"  attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F2_ARMCC"  name="MDK/Device/Source/ARM/STM32F2xx_OTP.s"  attr="template"  select="Flash One-Time programmable Bytes"/>
        
        <file category="header" name="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32F205xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f205xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F207xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f207xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F215xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f215xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F217xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f217xx.s" attr="config" version="2.0.1"/>
        <!-- GCC Toolchain -->
        <file category="source" condition="STM32F205xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f205xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F207xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f207xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F215xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f215xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F217xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f217xx.s" attr="config" version="2.0.1"/>
        <!-- IAR Toolchain -->
        <file category="source" condition="STM32F205xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f205xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F207xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f207xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F215xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f215xx.s" attr="config" version="2.0.1"/>
        <file category="source" condition="STM32F217xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f217xx.s" attr="config" version="2.0.1"/>

        <!-- system file -->
        <file category="source" name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/system_stm32f2xx.c" attr="config" version="2.0.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube Framework" Csub="Classic" Cversion="1.0.1" condition="STM32F2 Framework Classic">
      <description>Configuration via RTE_Device.h</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CLASSIC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/classic.html"/>
        <file category="header"  name="CMSIS/Driver/Config/RTE_Device.h" attr="config" version="2.2"/>
        <file category="header"  name="MDK/Templates/Inc/stm32f2xx_hal_conf.h" attr="config"/>
        <file category="source"  name="MDK/Templates/Src/stm32f2xx_hal_msp.c"  attr="template" select="MCU Specific HAL Initialization / De-Initialization"/>
        <file category="header"  name="MDK/Templates/Inc/stm32f2xx_it.h" attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="source"  name="MDK/Templates/Src/stm32f2xx_it.c" attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="header"  name="MDK/Templates/Inc/main.h" attr="template" select="'main' module for STM32Cube"/>
        <file category="source"  name="MDK/Templates/Src/main.c" attr="template" select="'main' module for STM32Cube"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" condition="STM32F2">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <!-- this component will be replaced by the component described in gpdsc from generator -->
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0"/>
      </files>
    </component>

