jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F2xx_DFP.2.4.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="USART" Cversion="1.0.1" condition="STM32F2 HAL DMA RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="WWDG" Cversion="1.0.1" condition="STM32F2 HAL">
      <description>Window watchdog (WWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_wwdg.c"/>
      </files>
    </component>

    <!-- END: STMicroelectronics STM32CubeF2 HAL -->

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0" Cversion="1.0" condition="STM32F2 CMSIS_Driver CAN">
      <description>CAN Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/CAN_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1"  Cversion="2.6" condition="STM32F2 CMSIS_Driver SPI">
      <description>SPI Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="2.3" condition="STM32F2 CMSIS_Driver USART">
      <description>USART Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
        #define RTE_Drivers_USART6              /* Driver USART6 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_STM32F2xx.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="2.4" condition="STM32F2 CMSIS_Driver I2C">
      <description>I2C Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="2.4" condition="STM32F2 CMSIS_Driver MCI">
      <description>MCI Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.3" condition="STM32F2 CMSIS_Driver ETH_MAC">
      <description>Ethernet MAC Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/EMAC_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1" Cversion="2.10" condition="STM32F2 CMSIS_Driver USB0">
      <description>USB Device Full-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_FS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="High-speed" Capiversion="2.1" Cversion="2.10" condition="STM32F2 CMSIS_Driver USB1">
      <description>USB Device High-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_HS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="Full-speed" Capiversion="2.0" Cversion="2.13" condition="STM32F2 CMSIS_Driver USB0">
      <description>USB Host Full-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_FS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="High-speed" Capiversion="2.0" Cversion="2.13" condition="STM32F2 CMSIS_Driver USB1">
      <description>USB Host High-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS_STM32F2xx.c"/>
      </files>
    </component>

    <!-- MCBSTM32F200 Development Board -->
    <bundle Cbundle="MCBSTM32F200" Cclass="Board Support" Cversion="2.0.0">
      <description>Keil Development Board MCBSTM32F200</description>
      <doc>MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200.chm</doc>
      <component Cgroup="LED" condition="STM32F2 HAL GPIO">
        <description>LED Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/LED_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="STM32F2 HAL GPIO">
        <description>Buttons Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Buttons_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" condition="STM32F2 HAL GPIO ADC">
        <description>A/D Converter Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/ADC_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" condition="STM32F2 CMSIS RTOS I2C_Driver">
        <description>Joystick Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Joystick_STMPE811.c"/>
        </files>
      </component>
