jack77er/openUTRUSTA/Packages/.cache/Keil.STM32F2xx_DFP.2.4.0.pdsc
      <component Cgroup="Touchscreen" condition="STM32F2 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Accelerometer" condition="STM32F2 CMSIS I2C_Driver">
        <description>Accelerometer Interface for LIS3DH</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Accelerometer_LIS3DH.c"/>
        </files>
      </component>
      <component Cgroup="Gyroscope" condition="STM32F2 CMSIS I2C_Driver">
        <description>Gyroscope Interface for L3G4200D</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Gyroscope_L3G4200D.c"/>
        </files>
      </component>
      <component Cgroup="Camera" condition="STM32F2 HAL GPIO DMA DCMI I2C_Driver">
        <description>Camera Interface for OVM7690</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Camera_OVM7690.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" condition="STM32F2 HAL GPIO SRAM">
        <description>Graphic LCD Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="MDK/Boards/Keil/MCBSTM32F200/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/GLCD_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Cvariant="16-bit IF" condition="STM32F2 HAL GPIO SRAM LCD_16">
        <description>emWin LCD 16-bit Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
